export default {
    name: "dashboard",
    data: () => ({

        myInfo: [
            {
                id: 'Пол',
                value: 'Жен',
                isBold: true
            },
            {
                id: 'Возраст',
                value: '25 лет',
                isBold: true
            },
            {
                id: 'ИНЗ',
                value: 171854193,
                isInz: true
            },
            {
                id: 'Дата взятия образца',
                value: '28.10.2021',
            },
            {
                id: 'Дата поступления образца',
                value: '29.10.2021',
            },
            {
                id: 'Врач',
                value: '29.10.2021',
            },
            {
                id: 'Дата печати результата',
                value: '29.10.2021',
            },
        ],

        table: [
            {
                val1: 'АлАТ',
                val2: '11',
                val3: 'Ед/л',
                val4: '< 31',
            },
            {
                val1: 'АсАТ',
                val2: '12',
                val3: 'Ед/л',
                val4: '< 31',
            },
            {
                val1: 'Билирубин общий',
                val2: '12.5',
                val3: 'мкмоль/л',
                val4: '3.4 - 20.5',
            },
            {
                val1: 'Фосфатаза щелочная',
                val2: '72',
                val3: 'Ед/л',
                val4: '40 - 150',
            },
            {
                val1: 'Глюкоза',
                val2: '4.6',
                val3: 'мкмоль/л',
                val4: '4.1 - 6.0',
            },
            {
                val1: 'Холестерин',
                val2: '4.12',
                val3: 'мкмоль/л',
                val4: 'см.комм',
                val5: 'Рекомендации по интерпретации:<br/>' +
                    'желательный уровень <5.0 ммоль/л. В<br/>' +
                    'индивидуальной оценке кардиориска<br/>' +
                    'холестерин следует использовать в<br/>' +
                    'комплексе с другими факторами (см.<br/>' +
                    'таблицы SCORE).',
            },
        ],

        table2: [
            {
                val1: 'Гематокрит',
                val2: '41.0',
                val3: '%',
                val4: '39.0 - 49.0',
            },
            {
                val1: 'Гемоглобин',
                val2: '14.2',
                val3: 'г/дл',
                val4: '13.2 - 17.3',
            },
            {
                val1: 'Эритроциты',
                val2: '5.10',
                val3: 'млн/мкл',
                val4: '4.30 - 5.70',
            },
            {
                val1: 'MCV (ср. объем эритр.)',
                val2: '83.7',
                val3: 'фл',
                val4: '80.0 - 99.0',
            },
            {
                val1: 'RDW (шир. распред. эритр)',
                val2: '12.1',
                val3: '%',
                val4: '11.6 - 14.8',
            },
            {
                val1: 'MCH (ср. содер. Hb в эр.)',
                val2: '27.9',
                val3: 'пг',
                val4: '27.0 - 34.0',
            },
            {
                val1: 'МСHС (ср. конц. Hb в эр.)',
                val2: '33.0',
                val3: 'г/дл',
                val4: '32.0 - 37.0',
            },
            {
                val1: 'Тромбоциты',
                val2: '218',
                val3: 'тыс/мкл',
                val4: '150 - 400',
            },
            {
                val1: 'Лейкоциты',
                val2: '8.12',
                val3: 'тыс/мкл',
                val4: '4.50 - 11.00',
            },
        ]

    }),
    methods: {
        openLoginPage(){
            window.location.href = '/login'
        }
    }
}
